<template>
    <div class="brief">
        <Table v-bind:books="books"/>
    </div>
</template>

<script>
    // @ is an alias to /src
    import Table from './Table'

    export default {
        name: 'brief',
        components: {
            Table
        },
        data(){
            return{
                books:[{
                    name:"白夜行",
                    Name:"baiyexing",
                    cover: require('../static/img/white.jpg'),
                    writer:"东野圭吾",
                    ISBN:"9787544291163",
                    price:59.60,
                    storage:300,
                    sales:4500000,
                    nameflag:false,
                    writerflag:false,
                    isbnflag:false,
                    priceflag:false,
                    storageflag:false,
                    salesfalg:false,
                    number:0,
                    rate:4.9,
                    brief:"\"我的人生就像一直行走在白夜里。我的新年愿望是能在白天走路。\"\n" +
                    "\"我的天空里没有太阳，总是黑夜，但并不黑暗，因为有东西代替了太阳。\"",
                    detail:"《白夜行》被普遍视为日本作家东野圭吾作品的无冕之王，一经推出即成为东野圭吾的长篇小说代表作，中文版销量超450万册，与《嫌疑人X的献身》《恶意》《解忧杂货店》并称为东野圭吾四大杰作。\n" +
                    "\n" +
                    "《白夜行》是东野圭吾当之无愧的鸿篇巨制，全书故事跨越19年时间，登场人物超过50个，草蛇灰线伏脉千里，情节线索纵横交错又丝丝入扣，用一桩离奇命案牵出案件相关人跨越19年惊心动魄的故事、悲凉的爱情、吊诡的命运、令人发指的犯罪、白描又生动的社会图景、复杂人性的对决与救赎，读来令人叹为观止。\n" +
                    "\n" +
                    "1973年，大阪一栋废弃建筑中发现一名遭利器刺死的男子。警方怀疑一个叫西本文代的女人，但缺少证据。不久西本被判定因意外事故死亡，从此案件成谜。此后19年，众多案件相关者的命运出现了离奇的转折，有人走向上流社会，有人在暗夜中游走挣扎。只有一个老警察追查不休，渐渐拼出了惊人的真相。",
                    writer_intro:"东野圭吾，日本作家。\n" +
                    "\n" +
                    "1985年，《放学后》获第31届江户川乱步奖，开始专职写作；\n" +
                    "\n" +
                    "1999年，《白夜行》获周刊文春推理小说榜年度第 1 名，《秘密》获第52届日本推理作家协会奖；\n" +
                    "\n" +
                    "2005年出版的《嫌疑人X的献身》同时获得第134届直木奖、第6届本格推理小说大奖，以及三大推理小说排行榜年度第 1 名；\n" +
                    "\n" +
                    "2008年，《流星之绊》获第43届新风奖；\n" +
                    "\n" +
                    "2009年出版的《新参者》获两大推理小说排行榜年度第 1 名；\n" +
                    "\n" +
                    "2012年，《解忧杂货店》获第7届中央公论文艺奖；\n" +
                    "\n" +
                    "2014年，《祈祷落幕时》获第48届吉川英治文学奖。",
                    comment:"亮司和雪穗为什么活得如此坚强？因为他们已经没有别的生存道路，不会迷茫。不迷茫，才可以那么坚强。——东野圭吾\n" +
                    "\n" +
                    "我花费了很多心思创作《白夜行》，这部作品无法轻易概括。我只想站在旁观者的角度描写一个人的成长经历，主人公的内心就交给读者自由想象。登场人物不知道发生了什么，唯有读者清楚真相。——东野圭吾\n" +
                    "\n" +
                    "《白夜行》将无望却坚守的凄凉爱情和执着而缜密的冷静推理完 美结合，被众多书迷视作东野圭吾作品中的无冕之王。——《北京晚报》",
                },
                    {
                        name:"深入理解计算机系统",
                        Name:"ics",
                        cover: require('../static/img/ics.jpg'),
                        writer:'兰德尔 E.布莱恩特',
                        ISBN:'9787111561279',
                        price:239.00,
                        storage:312,
                        sales:'5432',
                        nameflag:false,
                        writerflag:false,
                        isbnflag:false,
                        priceflag:false,
                        storageflag:false,
                        salesfalg:false,
                        number:0,
                        rate:4.9,
                        brief:"（英文版·第3版）",
                        detail:"本书从程序员的视角详细阐述计算机系统的本质概念，并展示这些概念如何实实在在地影响应用程序的正确性、性能和实用性。全书共12章，主要包括信息的表示和处理、程序的机器级表示、处理器体系结构、优化程序性能、存储器层次结构、链接、异常控制流、虚拟存储器、系统级I/O、网络编程、并发编程等内容。书中提供了大量的例子和练习题，并给出部分答案，有助于读者加深对正文所述概念和知识的理解。",
                        writer_intro:"Randal E. Bryant\n" +
                        "1973年获得密歇根大学学士学位，随即就读麻省理工学院的研究生院，并在1981年获得计算机博士学位。从1984年至今一直任教于卡内基-梅隆大学，现在是卡内基-梅隆大学计算机科学学院院长、教授，同时受邀任教于工学院电子与计算机工程系。他还是ACM院士、IEEE院士和美国国家工程院院士。其研究成果获得过数项大奖，其中包括Semiconductor Research Corporation颁发的两个发明荣誉奖和一个技术成就奖，ACM颁发的Kanellakis理论与实践奖，还有IEEE颁发的W. R. G. Baker奖、Emmanuel Piore奖和Phil Kaufman奖。\n" +
                        "\n" +
                        "David R. O,Hallaron\n" +
                        "拥有弗吉尼亚大学计算机科学博士学位，现为Intel匹兹堡实验室主任，卡内基-梅隆大学计算机科学和电子与计算机工程副教授。他曾获得卡内基-梅隆大学计算机科学学院颁发的Herbert Simon杰出教学奖，并同Quake项目中其他成员一起获得了高性能计算领域中的高国际奖项——Gordon Bell奖",
                        comment:""
                    },
                    {
                        name:'数据库系统概念',
                        Name:"database",
                        cover: require('../static/img/db.jpg'),
                        writer:'Abraham Silberschatz等',
                        ISBN:'9787040311754',
                        price:72.00,
                        storage:0,
                        sales:'2019',
                        nameflag:false,
                        writerflag:false,
                        isbnflag:false,
                        priceflag:false,
                        storageflag:false,
                        salesfalg:false,
                        number:0,
                        rate:4.7,
                        brief:"(第6版 影印版) ",
                        detail:"本书是经典的数据库系统教科书《DatabaseSystemConcepts》的*修订版，全面介绍数据库系统的各种知识，透彻阐释数据库管理的基本概念。本书内容丰富，不仅讨论了关系数据模型和关系语言、数据库设计过程、关系数据库理论、数据库应用设计和开发、数据存储结构、数据存取技术、查询优化方法、事务处理系统和并发控制、故障恢复技术、数据仓库和数据挖掘，而且对性能调整、性能评测标准、数据库应用测试和标准化、空间和地理数据、时间数据、多媒体数据、移动和个人数据库管理以及事务处理监控器、事务工作流、电子商务、高性能事务系统、实时事务系统和持续长时间的事务等高级应用主题进行了广泛讨论。\n" +
                        "\n" +
                        "本书既可作为高年级本科生或低年级研究生的数据库课程教材，也可供数据库领域的技术人员参考。",
                        writer_intro:"Abraham Silberschatz，著名的技术专家、教育家和研究者，IEEE高级会员、ACM高级会员、荷兰皇家艺术和科学院院士、1994年ACM Karl V. Karlstrom杰出教育奖、1997年ACM计算机科学教育杰出贡献奖、2002年Texty卓越教材奖、第10届ACM操作系统原理研讨会杰出论文奖、被列入“Who's Who in the World”人物目录。他的研究兴趣包括操作系统、数据库系统、实时系统、存储系统、网络管理和分布式系统。他获得了2002年IEEE泰勒？布斯教育奖，1998年ACM Karl V. Karlstrom杰出教育家奖，1997年ACM SIGMOD贡献奖，以及IEEE计算机协会优秀论文奖。",
                        comment:"本书是国外数据库的经典教材之一，版本不断更新。不仅对数据库基础知识讲解透彻，也及时充跟进数据库发展前言，对移动及个人数据库管理、电子商务等相关主题做了广泛的讨论，有助于读者在掌握数据库基本技能的同时，也能开阔视野，对相关技术的发展也能有所涉足和了解。"
                    },
                    {
                        name:'向左走·向右走',
                        Name:"turn_left_turn_right",
                        cover: require('../static/img/turnlr.jpg'),
                        writer:'幾米',
                        ISBN:'9787510872822',
                        price:48.00,
                        storage:5200,
                        sales:'720',
                        nameflag:false,
                        writerflag:false,
                        isbnflag:false,
                        priceflag:false,
                        storageflag:false,
                        salesfalg:false,
                        number:0,
                        rate:4.9,
                        brief:"她习惯向左走，他习惯向右走，是什么让他们相遇 一墙之隔的都市男女，变幻莫测的缘分纠葛 孤独的现代都市人对于浪漫爱情的美好憧憬 ",
                        detail:"《向左走·向右走》是幾米表现男女感情的长篇图文创作。生活在都市仅一墙之隔的男女主角有着太多一样的生活经历，可是一个总向左走一个总向右走，不曾相遇。直到一天下午他们在公园相见，度过了一段再美好不过的时光。他们互留电话，约定着下次相见，但是，人生又总有许多意外，握在手里的风筝也会突然断了线……冬天好冷，春天什么时候来呢？",
                        writer_intro:"幾米，本名廖福彬，台湾知名绘本画家。1998年开始出版个人的绘本，开成人绘本创作之先，至今出版各式作品五十多种。作品被翻译成英、法、荷、西、葡、意、日、希腊、韩、泰、俄、波兰、爱沙尼亚、瑞典等多种语言，也与英国、美国、日本的出版社合作原创绘本。多部作品被改编成音乐剧、电视剧及电影，得过多座金鼎奖。他还获得比利时维塞勒青少年文学奖、西班牙教育文化体育部主办的出版奖之艺术类图书年度首奖、瑞典彼得潘银星奖，也入围林格伦纪念奖，这是国际上zui大的儿童及青少年文学奖项。",
                        comment:"《向左走·向右走》是幾米知名的经典作品之一，是一本带给无数人心灵触动的都市情感绘本，由此改编的同名电视剧、电影和音乐剧均深受欢迎。\n" +
                        "\n" +
                        "一个习惯向左走，一个习惯向右走，是什么让他们相遇？爱情不期而至，命运变幻莫测。他们的故事诚如书中引用的辛波丝卡的那句诗：确定是美丽的，但变幻无常更为美丽。\n" +
                        "\n" +
                        "吐露现代都市人内心深处不为人知的孤独，表现他们对于浪漫爱情的美好憧憬。\n" +
                        "\n" +
                        "简洁的构图、纯净的色彩、贴切的旁白，再加上命运开的一次次玩笑，为我们营造了一个既温馨又揪心的爱情故事。"
                    },
                    {
                        name:'时间简史',
                        Name:"shijianjianshi",
                        cover: require('../static/img/timehis.jpg'),
                        writer:'史蒂芬·霍金',
                        ISBN:'9787535732309',
                        price:45.00,
                        storage:520000,
                        sales:'500000',
                        nameflag:false,
                        writerflag:false,
                        isbnflag:false,
                        priceflag:false,
                        storageflag:false,
                        salesfalg:false,
                        number:0,
                        rate:4.9,
                        brief:"（插图本）",
                        detail:"史蒂芬·霍金生于1942年，他的生日恰好与伽利略去世的纪念日是同一天。他现任剑桥大学卢卡斯数学系教授教席（这一职位曾由艾萨克·牛顿担任）。他被誉为继爱因斯坦后*杰出的理论物理学家。他于1993年出版了《霍金讲演录——黑洞、婴儿宇宙及其他》。这本书是理论物理学方面的经典著作，其中的内容已被许多科学论文和书籍引用。\n" +
                        "史蒂芬·霍金的《时间简史》自1988年首版以来的岁月里，已成为全球科学著作的里程碑。它被翻译成40种文字，销售了近1000万册，成为国际出版史上的奇观。该书内容是关于宇宙本性的*前沿知识，但是从那以后无论在微观还是宏观宇宙世界的观测技术方面都有了非凡的进展。这些观测证实了霍金教授在该书*版中的许多理论预言，其中包括宇宙背景探险者卫星（COBE）的*近发现，它在时间上回溯探测到离宇宙创生的30万年之内，并显露了他所计算的在时空结构中的涟漪。",
                        writer_intro:"史蒂芬·霍金出生于1942年，他的生日恰好是伽利略逝世三百年忌日。他现任剑桥大学卢卡斯数学教授(这一教席曾由艾萨克·牛顿所任)。他广被推崇为继爱因斯坦后最杰出的理论物理学家。他的其他两部主要著作是《霍金讲演录——黑洞、婴儿宇宙及其他》和《果壳中的宇宙》。",
                        comment:"史蒂芬·霍金的《时间简史》自1988年首版以来的岁月里，已成为全球科学著作的里程碑。它被翻译成40种文字，销售了近1000万册，成为国际出版史上的奇观。"
                    },
                    {
                        name:'悟空传',
                        Name:"wukongzhuan",
                        cover: require('../static/img/wukong.jpg'),
                        writer:'今何在',
                        ISBN:'9787550277670',
                        price:31.00,
                        storage:200,
                        sales:'50',
                        nameflag:false,
                        writerflag:false,
                        isbnflag:false,
                        priceflag:false,
                        storageflag:false,
                        salesfalg:false,
                        number:0,
                        rate:4.9,
                        brief:"“尽管在当时，你感受到的只是各种情绪的冲撞——空虚、无聊、迷惑、愤怒、渴望爱情、畅谈理想……然后看见平庸的现实。但那时，我拥有时间。”\n" +
                        "“眺望未来，总是那么遥远。然而你一眨眼时，它就从你的身边掠过，成了逝去。”\n" +
                        "“这漫长而短暂的一生，究竟该用来追求些什么呢？”",
                        detail:"这是一群人，用一生寻找答案的故事。他们也许弱小，但他们始终不放弃希望。这个天地我来过，我奋战过，我深爱过，我不在乎结局。\n" +
                        "    五百年前的齐天大圣，五百年后戴上金箍，踏上了西游之路。前尘尽忘，他挥棒指向曾经并肩作战的兄弟；曾经英俊潇洒的天蓬元帅，转世成为一只猪妖。爱人远在天上，就算终有一天相见，也不忍相认；金蝉子和如来打赌证法，用自己的轮回宿命，来赌世人不屈的反抗之心；小白龙誓死不嫁入天庭，情愿化作一匹白马，用一生沉默为代价，陪伴在爱人左右……\n" +
                        "    总有一天，天宫会再次燃起大火，诸神的权威会再次接受挑战。因为有这样一群人，他们宁肯死，也不肯输。",
                        writer_intro:"今何在，畅销小说作者，知名游戏策划，大型幻想世界“九州”创始人。代表作品有《悟空传》《西游日记》《九州·海上牧云记》《九州·羽传说》，以及与周星驰合著的电影小说《西游.降魔篇》等。",
                        comment:"网络文学奠基作品。作为对传统名著的另类解读，《悟空传》是开创了我国网络文学全盛时代的里程碑式作品。它见证了一代人的青春，受到无数热爱自由的年轻读者的极力追捧。在豆瓣评分高达8.9，170960名实体书读者在各个网站参与讨论，十五年间出版7次，加印147次，创下两百万册销售记录。是人气长盛不衰的畅销经典之作。"
                    },
                    {
                        name:'流浪的地球',
                        Name:"liulangdiqiu",
                        cover: require('../static/img/earth.jpg'),
                        writer:'刘慈欣',
                        ISBN:'9787553671413',
                        price:29.00,
                        storage:2000,
                        sales:'7004',
                        nameflag:false,
                        writerflag:false,
                        isbnflag:false,
                        priceflag:false,
                        storageflag:false,
                        salesfalg:false,
                        number:0,
                        rate:4.9,
                        brief:"“我们必须怀有希望，这并不是因为希望真的存在，而是因为我们要做高贵的人。\n" +
                        "希望是这个时代的黄金和宝石，不管活多长，我们都拥有它！",
                        detail:"小说讲述了太阳即将变成红巨星，毁灭全太阳系里的行星，人类启动庞大的地球逃脱计划，在地球的一侧安装上巨大的地球发动机，将整个巨大地球环境圈化为的移民方舟，逃离太阳系，寻找新家园。作品宏伟大气、想象瑰丽，2000年荣获中国科幻银河奖特等奖，被誉为刘慈欣《三体》之外*有名作品。改编自《流浪的地球》的同名科幻电影正在即将被搬上银幕！",
                        writer_intro:"刘慈欣\n" +
                        "\n" +
                        "中国科幻小说的代表作家，被誉为“中国科幻的领军人物”。作品因宏伟大气、想象绚丽获得广泛赞誉。代表作有长篇《超新星纪元》《三体》《流浪地球》等。2015年，他凭借《三体》获第73届世界科幻大会颁发的雨果奖*长篇小说奖，为亚洲首次",
                        comment:"此作品极为感人。有人言，没看过这篇小说就不算看过小说。在读过刘慈欣几乎所有作品以后，我毫不怀疑，这个人单枪匹马，把中国科幻文学提升到了*的水平。\n" +
                        "\n" +
                        "——复旦大学中文系教授　严锋\n" +
                        "\n" +
                        " \n" +
                        "\n" +
                        "走进刘慈欣的世界，你立刻会感受到如粒子风暴般扑面而来的澎湃的激情—对科学、对技术的激情。正是这种激情，使他的世界灿烂如银河之心。\n" +
                        "\n" +
                        "——《科幻世界》杂志副总编　姚海军"
                    },
                    {
                        name:'人间失格',
                        Name:"renjianshige",
                        cover: require('../static/img/renjianshige.jpg'),
                        writer:'太宰治',
                        ISBN:'9787506380263',
                        price:25.00,
                        storage:5000,
                        sales:'952857',
                        nameflag:false,
                        writerflag:false,
                        isbnflag:false,
                        priceflag:false,
                        storageflag:false,
                        salesfalg:false,
                        number:0,
                        rate:4.9,
                        brief:"（日本小说家太宰治的自传体小说） ",
                        detail:"胆小鬼连幸福都害怕，碰到棉花都会受伤\n" +
                        "　　人间失格，即丧失为人的资格。这是太宰治生平*后一部作品，也是他*重要的作品。全书由作者的序言、后记，以及主角大庭叶藏的三个手札组成，描写主角从青少年到中年，为了逃避现实而不断沉沦，经历自我放逐、酗酒、自杀、用药物麻痹自己，终于一步步走向自我毁灭的悲剧，在自我否定的过程中，抒发自己内心深处的苦闷，以及渴望被爱的情愫……\n" +
                        "　　借由主角叶藏的人生遭遇，太宰治巧妙地将自己的一生与思想刻画其中，这部小说一直被认定为他的自传性作品，并且藉此提出身为人*真切的痛苦问题，从滞涩的行文中更可体会其内心深切的苦楚，完成本篇作品之后，太宰治终归还是选择了投水的方式，为自己划下*后的句点。",
                        writer_intro:"太宰治\n" +
                        "　　“私小说”领域的天才作家。与川端康成、三岛由纪夫齐名，被视为日本战后文学的*人物，后人将其称为“无赖派大师”。\n" +
                        "　　太宰治出身于日本东北地主家庭，从小体弱敏感。中学开始对文学着迷，崇拜泉镜花和芥川龙之介。高中时立志于文学创作，开始发表随笔。1935年凭借《逆行》入围第一届芥川奖候补作品。1945年《女学生》获第四届北村透谷文学奖。太宰治的《人间失格》《斜阳》《Goodbye》《维庸之妻》等被认为是其*秀的作品。太宰治一生多次求死，直至1948年自杀，在其短暂的一生中，他向世人展示了无与伦比的文学才华，留下众多不朽佳作。其多数作品采用“私小说”的自我告白形式，充满了纯粹而敏锐的感受性，吸引着一代又一代的年轻人。",
                        comment:"名家推荐村上春树《且听风吟》中“十全十美的文章和彻头彻尾的绝望”深受太宰治和三岛由纪夫之影响。\n" +
                        "　　——佐藤干夫\n" +
                        "　　无论是喜欢他还是讨厌他，是肯定他还是否定他，太宰的作品总拥有着一种不可思议的魔力，在今后很长一段时间里，太宰笔下生动的描绘都会直逼读者的灵魂，让人无法逃脱。\n" +
                        "　　——奥野健男\n" +
                        "　　太宰治的作品分为二个人格，一方面有带着自身经历主人公的挣扎；另一方面是坦然描述着血的事实。正因如此，他比那些把自己当做作上帝的作家，更有一丝人情，更能打动读者。\n" +
                        "　　——高尔基\n" +
                        "　　精神的洁癖，让像太宰治一样的人容不得半点的伤害，他活在自己的世界里，卑微而自由。他想要打破什么，却又没有方向。他的痛苦在于他用心看着漆黑的世界。\n" +
                        "　　——鲁迅"
                    },
                    {
                        name:'瓦尔登湖',
                        Name:"waldenlake",
                        cover: require('../static/img/walden.jpg'),
                        writer:'（美）亨利戴维梭罗',
                        ISBN:'9787506382502',
                        price:25.00,
                        storage:54321,
                        sales:'14452',
                        nameflag:false,
                        writerflag:false,
                        isbnflag:false,
                        priceflag:false,
                        storageflag:false,
                        salesfalg:false,
                        number:0,
                        rate:4.9,
                        brief:"我步入丛林，因为我希望生活得有意义，我希望活的深刻，并汲取生命中所有的精华。然后从中学习，以免让我在生命终结时，却发现自己从来没有活过。",
                        detail:" 梭罗远离尘嚣，他想在自然的安谧中寻找一种本真的生存状态，寻求一种更诗意的生活。《瓦尔登湖》一书，详细地记录了作家在长达两年的时间里的日常生活状态以及所思所想，他在小木屋旁开荒种地，春种秋收，自给自足。他是一个自然之子，他崇尚自然，与自然交朋友，与湖水、森林和飞鸟对话，在林中观察动物和植物，在船上吹笛，在湖边钓鱼，晚上，在小木屋中记下自己的观察和思考。他追求精神生活，关注灵魂的成长，他骄傲地宣称：“每个人都是自己王国的国王，与这个王国相比，沙皇帝国也不过是一个卑微小国，犹如冰天雪地中的小雪团。”梭罗以他的实际行动告诉我们：人们所追求的大部分奢侈品，大部分的所谓生活的舒适，非但没有必要，而且对人类进步大有妨碍。\n" +
                        "\n" +
                        "《瓦尔登湖》记述了作者在简单生活中深入思考与重塑自我的心路历程，文笔宁静恬淡，引人深思，具有一种使人沉静的力量。 ",
                        writer_intro:"亨利戴维梭罗\n" +
                        "　　美国作家、哲学家、思想家。倡导朴素、真实、清醒、自然的生活方式。曾在瓦尔登湖畔隐居两年，自耕自食，并以此为题材创作了长篇散文《瓦尔登湖》，成为超验主义经典作品。梭罗才华横溢，一生创作了二十多部散文集，被称为自然随笔的创始者。其文简练有力，富有思想性，在美国文坛独树一帜。在《瓦尔登湖》中梭罗阐述了研究环境史和生态学的发现和方法，对自然文学写作的影响甚远，也奠定了现代环境保护主义的基础，在美国文学中被公认为是最受读者欢迎的非虚构作品。",
                        comment:"瓦尔登湖》是一本寂寞的书，一本孤独的书，一本智慧的书。它适合在寂寞和恬静时阅读，静静地读，读得静静。我想，从这个意义上来说，《瓦尔登湖》是属于心灵的。\n" +
                        "　　——乔治艾略特\n" +
                        "\n" +
                        "　　梭罗是一位天才人物，更是一位了不起的作家，他写出了本国*好的书。他说要敢于对抗常识，别人说的，不一定就是你所看到的，你需要自己寻找出一条以你而命名的路。\n" +
                        "　　——马修阿诺德\n" +
                        "\n" +
                        "　　梭罗这人有脑子，像鱼有水、鸟有翅、云彩有天空，梭罗这人就是我的云彩，四方邻国的云彩，安静在豆田之西，我的草帽上。　\n" +
                        "\n" +
                        "　　——海子 "
                    },
                    {
                        name:'软件工程原理',
                        Name:"se",
                        cover: require('../static/img/se.jpg'),
                        writer:'沈备军,陈昊鹏,陈雨亭',
                        ISBN:'9787040369069',
                        price:48.00,
                        storage:2,
                        sales:'500',
                        nameflag:false,
                        writerflag:false,
                        isbnflag:false,
                        priceflag:false,
                        storageflag:false,
                        salesfalg:false,
                        number:0,
                        rate:4.9,
                        brief:"高等学校软件工程系列教材",
                        detail:"《普通高等教育“十一五”*规划教材·高等学校软件工程系列教材：软件工程原理》覆盖软件工程知识体系（SWEBOK）（第3版）的全部核心知识域，从软件工程的本质出发，系统、全面地介绍软件过程、软件建模技术和方法以及软件工程管理，同时介绍一些热点新技术和新方法。全书分为三大部分，共20章。第一部分为软件工程基础，讲述软件工程的基本原则、软件过程以及从需求、设计、测试到维护的活动，共9章。第二部分为软件工程管理，讲述工程管理的重要知识域，包括软件项目管理、软件项目估算和计划、软件质量管理、软件风险管理、软件度量和人员管理，共6章。第三部分为高级主题，讲述当前热门的一些新技术和新方法，共5章。此外，《普通高等教育“十一五”*规划教材·高等学校软件工程系列教材：软件工程原理》还以一个汽车4S店业务管理系统为案例，阐述软件工程从需求、设计、测试到管理等各核心环节，使学生扎实地掌握理论知识，培养其解决实际问题的能力。\n" +
                        "　　《普通高等教育“十一五”*规划教材·高等学校软件工程系列教材：软件工程原理》可供本科生、硕士生学习“软件工程”、“高级软件工程”、“软件过程”、“软件项目管理”等课程使用，同时对于从事软件开发、维护和管理的各类人员也可起到非常好的借鉴作用。",
                        writer_intro:"",
                        comment:"普通高等教育“十一五”*规划教材·高等学校软件工程系列教材：软件工程原理》特色：\n" +
                        "　　从软件工程的本质出发、结合实际案例，系统全面地介绍软件过程、软件建模技术与方法及软件工程管理同时介绍一些热点新技术和新方法。\n" +
                        "　　内容覆盖SWEBOK第3版的全部核心知识域，力求体现国际软件工程本科教学课程大纲（CCSE）、国际软件工程硕士教学课程大纲（GSWE）、CSDA和CSDP认证考试大纲要求并加强软件安全工程的内容。\n" +
                        "　　案例贯穿软件工程核心环节以一个汽车4S店业务管理系统为案例阐述软件工程从需求、设计、测试到管理等各核心环节，使学生扎实地掌握理论知识，培养其解决实际问题的能力。\n" +
                        "　　提供电子教案等配套教学资源以便高校师生教学使用。 "
                    }],

            }
        }
    }
</script>